kushuninan-git/stm32f103zet6RTOS/user/main.c
        // // 每5次读取打印一次增强调试信息
        // if (++debug_counter >= 5)
        // {
        //     BH1750_Debug(); // 打印增强的BH1750数据
        //     debug_counter = 0;
        // }

        vTaskDelay(1000); // 1秒读取一次（更频繁）
    }
}
// 语音模块任务
void Su03tTask(void *pvParameters)
{
    Su03t_Init(); // 初始化语音模块
    for (;;)
    {
        // 1. 先尝试读取并解析数据
        if (Su03t_ReadData() == SU03T_OK)
        {
            // 2. 只有解析成功（收到有效数据）时才打印和处理
            Su03t_Debug();          // 打印有效数据（此时 data 不为 0）
            Su03t_Handle_Command(); // 处理命令（处理完后会将 data 置 0）
        }
        vTaskDelay(100);
    }
}
// 云数据解析任务
void YunDataHandleTask(void *pvParameters)
{
    for (;;)
    {
        YunDataHandle();
        vTaskDelay(100);
    }
}
// LCD任务
void LCDTask(void *pvParameters)
{
    // LCD_Init();    // 初始化LCD
    // LCD_UI_Init(); // 初始化LCD UI界面
    u8 lcdbuff[50] = {0};
    SENSORDATA sensor_data = {0};
    for (;;)
    {
        // 从消息队列接收数据,一直等待直到接收成功
        xQueueReceive(xQueue1, &sensor_data, portMAX_DELAY);

        // 更新全局传感器数据，供MQTT任务使用（实现"复制函数"）
        switch (sensor_data.id)
        {
        case SENSOR_ID_DHT11:
            current_sensor_data.dht11data[0] = sensor_data.dht11data[0];
            current_sensor_data.dht11data[1] = sensor_data.dht11data[1];
            break;
        case SENSOR_ID_KQM:
            current_sensor_data.kqmdata[0] = sensor_data.kqmdata[0];
            current_sensor_data.kqmdata[1] = sensor_data.kqmdata[1];
            current_sensor_data.kqmdata[2] = sensor_data.kqmdata[2];
            break;
        case SENSOR_ID_LIGHT:
            current_sensor_data.lightdata[0] = sensor_data.lightdata[0];
            current_sensor_data.lightdata[1] = sensor_data.lightdata[1];
            break;
        case SENSOR_ID_BH1750:
            current_sensor_data.bh1750data = sensor_data.bh1750data;
            break;
        case SENSOR_ID_RTC:
            memcpy(current_sensor_data.rtcdata, sensor_data.rtcdata, sizeof(sensor_data.rtcdata));
            break;
        }

        // 根据传感器ID更新LCD数据
        switch (sensor_data.id)
        {
        case SENSOR_ID_DHT11:
            // printf("tem: %.1f hum: %.1f\n", sensor_data.dht11data[0], sensor_data.dht11data[1]);
            memset(lcdbuff, 0, sizeof(lcdbuff));
            sprintf((char *)lcdbuff, "温度:% .1f℃ ", sensor_data.dht11data[0]);
            lv_label_set_text(guider_ui.screen_data_label_tem, (char *)lcdbuff);

            sprintf((char *)lcdbuff, "湿度:% .1f%%", sensor_data.dht11data[1]);
            lv_label_set_text(guider_ui.screen_data_label_hum, (char *)lcdbuff);
            break;
        case SENSOR_ID_KQM:
            // printf("KQM: co2: %.2f ch2o: %.2f voc: %.2f\n", sensor_data.kqmdata[0], sensor_data.kqmdata[1], sensor_data.kqmdata[2]);
            memset(lcdbuff, 0, sizeof(lcdbuff));
            sprintf((char *)lcdbuff, "CO2  :% .2fppm", sensor_data.kqmdata[0]);
            lv_label_set_text(guider_ui.screen_data_label_CO2, (char *)lcdbuff);

            sprintf((char *)lcdbuff, "CH2O :% .2fppm", sensor_data.kqmdata[1]);
            lv_label_set_text(guider_ui.screen_data_label_CH2O, (char *)lcdbuff);

            sprintf((char *)lcdbuff, "VOC  :% .2fppm", sensor_data.kqmdata[2]);
            lv_label_set_text(guider_ui.screen_data_label_VOC, (char *)lcdbuff);
            break;
        case SENSOR_ID_LIGHT:
            // printf("light: %04d, yanwu: %04d\n", sensor_data.lightdata[0], sensor_data.lightdata[1]);
            memset(lcdbuff, 0, sizeof(lcdbuff));
            sprintf((char *)lcdbuff, "light:%02d lm", sensor_data.lightdata[0]);
            lv_label_set_text(guider_ui.screen_data_label_lm, (char *)lcdbuff);

            sprintf((char *)lcdbuff, "yanwu:%02d ppm", sensor_data.lightdata[1]);
            lv_label_set_text(guider_ui.screen_data_label_yanwu, (char *)lcdbuff);
            break;
        case SENSOR_ID_BH1750:
            // printf("BH1750: %.1f lx \n", sensor_data.bh1750data);
            memset(lcdbuff, 0, sizeof(lcdbuff));
            sprintf((char *)lcdbuff, "BH:%.1f lx", sensor_data.bh1750data);
            lv_label_set_text(guider_ui.screen_data_label_lx, (char *)lcdbuff);
            break;
        case SENSOR_ID_RTC:
            // printf("RTC: %04d, %02d, %02d, %02d, %02d, %02d, %d\n", sensor_data.rtcdata[0], sensor_data.rtcdata[1], sensor_data.rtcdata[2], sensor_data.rtcdata[3], sensor_data.rtcdata[4], sensor_data.rtcdata[5], sensor_data.rtcdata[6]);
            memset(lcdbuff, 0, sizeof(lcdbuff));
            sprintf((char *)lcdbuff, "%04d-%02d-%02d %02d:%02d", sensor_data.rtcdata[0], sensor_data.rtcdata[1], sensor_data.rtcdata[2], sensor_data.rtcdata[3], sensor_data.rtcdata[4]);
            lv_label_set_text(guider_ui.screen_data_label_time, (char *)lcdbuff);
            break;
        default:
            break;
        }
    }
}
// wifi任务
void WifiTask(void *pvParameters)
{

    Uart3_Init();
    for (;;)
    {

        if (esp.state == 1)
        {
            ESP_AP();
        }
        else if (esp.state >= 2 && esp.state <= 5)
        {
            UpDataYun();
        }

        if (esp.heartbeat_req == 1)
        {
            esp.heartbeat_req = 0;
            MQTT_REQ();
        }
        vTaskDelay(100);
    }
}
// lvgl任务
void LVGLTask(void *pvParameters)
{
    while (1)
    {
        lv_task_handler();
        vTaskDelay(100);
    }
}
// 定时器回调函数
// void vTimerCallback(TimerHandle_t xTimer)
//{
//    // 获取定时器ID
//    uint32_t ulCount = (uint32_t)pvTimerGetTimerID(xTimer);
//    // printf("Timer ID: %d\n", ulCount);
//}
// WIFI回调函数
void wifibackFunction(TimerHandle_t xTimer)
{
    static uint8_t num = 0;
    uint32_t ulCount = (uint32_t)pvTimerGetTimerID(xTimer);
    if (ulCount == 2)
    {
        if (esp.state == 0)
        {
            num++;
            if (num >= 10)
            {
                esp.state = 2;
                printf("选择sta模式\r\n");
            }
        }
    }
    if (esp.state == 5)
    {
        esp.heartbeat_req = 1;
    }
    static uint32_t report_cnt = 0;
}

// 任务状态显示定时器回调函数
uint8_t CPU_RunInfo[400] = {0};
void vCallbackFunction(TimerHandle_t xTimer1)
{
    memset(CPU_RunInfo, 0, 400);
    vTaskList((char *)&CPU_RunInfo);
    printf("---------------------------------------------\r\n");
    printf("任务名 任务状态 优先级 剩余栈 任务序号\r\n");
    printf("%s", CPU_RunInfo);
    printf("---------------------------------------------\r\n");
}
int main(void)
{
    // 为了烧录语音
    //  while (1)
    //  {
    //  }

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); // 中断分组2（2位抢占+2位子优先级）
    USART1_Init();                                  // 初始化串口1
    TIM_Init();                                     // 初始化定时器
    sFLASH_Init();
    lv_init();           // 初始化lvgl
    lv_port_disp_init(); // 初始化lvgl显示接口

    setup_scr_screen_open(&guider_ui);  // 初始化打开界面
    setup_scr_screen_data(&guider_ui);  // 初始化数据界面
    setup_scr_screen_wifi(&guider_ui);  // 初始化wifi界面
    lv_scr_load(guider_ui.screen_open); // 加载欢迎界面
    // 创建队列，用于存储传感器数据，队列长度为5，每个元素大小为SENSORDATA结构体大小
    xQueue1 = xQueueCreate(5, sizeof(SENSORDATA));
    // 创建信号量
    xSemaphore1 = xSemaphoreCreateBinary();

    // 创建事件组
    myevent_group = xEventGroupCreate();
    // 创建软件定时器
    // xTimer1 = xTimerCreate(
    //     "Timer1",           // 定时器名称
    //     1000,               // 定时器周期，单位为系统时钟周期数（1000ms）
    //     pdTRUE,             // 自动重装载模式
    //     (void *)0,          // 传递给定时器回调函数的参数
    //     vCallbackFunction); // 定时器回调函数
    wifitimer = xTimerCreate("wifiTimer", 50000, pdTRUE, (void *)1, wifibackFunction);
    aptimer = xTimerCreate("apTimer", 1000, pdTRUE, (void *)2, wifibackFunction);
    // 启动定时器,第二个参数为阻塞时间,这里设置为0,表示不阻塞
    // xTimerStart(xTimer1, 0);
    xTimerStart(wifitimer, 0);
    xTimerStart(aptimer, 0);
    // 4. 创建任务
    BaseType_t xReturned; // 任务创建返回值变量

