kushuninan-git/stm32f103zet6RTOS/user/main.c
// 4. 语音模块命令处理
// switch (su03t.date)
// {
// case 0x01: // 语音模块返回0x01时，打开LED1
//     LED1_ON();
//     su03t.date = 0;
//     break;
// case 0x10: // 语音模块返回0x10时，关闭LED1
//     LED1_OFF();
//     su03t.date = 0;
//     break;
// case 0x06: // 语音模块返回0x06时，开始传输二氧化碳浓度
//     _uart_co2_2(kqm.co2);
//     su03t.date = 0;
//     break;
// case 0x07: // 语音模块返回0x07时，开始传输甲醛浓度
//     _uart_ch2o_2(kqm.ch2o);
//     su03t.date = 0;
//     break;
// case 0x08: // 语音模块返回0x08时，开始传输VOC浓度
//     _uart_voc_2(kqm.voc);
//     su03t.date = 0;
//     break;
// case 0x09: // 语音模块返回0x09时，开始传输湿度
//     _uart_hum_2(dht.hum);
//     su03t.date = 0;
//     break;
// case 0x0A: // 语音模块返回0x0A时，开始传输温度
//     _uart_tem_2(dht.tem);
//     su03t.date = 0;
//     break;

//  default: // 无匹配指令时，保持当前状态
//     break;
// }
// }

//  }
// ==================== STM32低功耗模式 ====================

// /**
//  * @brief 睡眠模式 (Sleep Mode)
//  * 功耗：低
//  * 唤醒源：任意中断
//  * 特点：
//  * - 处理器停止， peripherals继续工作
//  * - 所有寄存器和内存内容保持
//  * - 唤醒时间短（微秒级）
//  * 注意事项：
//  * - 唤醒后程序从断点处继续执行
//  * - 不需要重新初始化系统
//  */
// // __WFI(); // Wait For Interrupt，进入睡眠模式
// //  __WFE(); // Wait For Event，进入睡眠模式

// /**
//  * @brief 停机模式 (Stop Mode)
//  * 功耗：极低
//  * 唤醒源：
//  * - WKUP引脚上升沿
//  * - RTC闹钟事件
//  * - USB唤醒事件
//  * - 外部中断线(EXTI Line)
//  * 特点：
//  * - 处理器和 peripherals停止
//  * - 内存内容保持
//  * - 唤醒时间中等（毫秒级）
//  * 注意事项：
//  * - 唤醒后需要重新初始化系统时钟
//  * - 必须调用SystemInit()重新配置时钟
//  */
// /* PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);
//    SystemInit(); // 唤醒后必须重新初始化系统时钟
//    // 重新配置其他外设时钟 */

// /**
//  * @brief 待机模式 (Standby Mode)
//  * 功耗：最低
//  * 唤醒源：
//  * - WKUP引脚上升沿
//  * - RTC闹钟事件
//  * - IWDG复位
//  * 特点：
//  * - 几乎所有电路都停止工作
//  * - 只有备份寄存器和待机电路保持供电
//  * - 唤醒时间较长（毫秒级）
//  * - 相当于系统复位
//  * 注意事项：
//  * - 唤醒后程序从复位向量开始执行（相当于重新上电）
//  * - 所有寄存器和RAM内容丢失，除了备份寄存器
//  * - 必须清除Wake-Up标志位
//  * - 必须使能WKUP引脚唤醒功能
//  */
// /* PWR_ClearFlag(PWR_FLAG_WU); // 清除唤醒标志位
//    PWR_WakeUpPinCmd(ENABLE); // 使能WKUP引脚的唤醒功能
//    PWR_EnterSTANDBYMode(); // 进入待机模式
//    // 唤醒后程序从main函数开始执行 */

// // ==================== RTC唤醒相关配置 ====================

// /**
//  * @brief 配置RTC闹钟唤醒
//  * 用于从停机模式或待机模式唤醒系统
//  */
// void RTC_AlarmConfig(void)
// {
//     // 使能备份区域访问
//     RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
//     PWR_BackupAccessCmd(ENABLE);

//     // 配置RTC闹钟
//     RTC_AlarmCmd(DISABLE);               // 先禁用闹钟
//     RTC_SetAlarm(RTC_GetCounter() + 10); // 设置10秒后闹钟
//     RTC_AlarmCmd(ENABLE);                // 使能闹钟

//     // 使能RTC闹钟中断
//     RTC_ITConfig(RTC_IT_ALR, ENABLE);

//     // 配置NVIC
//     NVIC_InitTypeDef NVIC_InitStructure;
//     NVIC_InitStructure.NVIC_IRQChannel = RTC_IRQn;
//     NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
//     NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
//     NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//     NVIC_Init(&NVIC_InitStructure);
// }

// /**
//  * @brief RTC中断处理函数
//  * 用于处理RTC闹钟事件
//  */
// void RTC_IRQHandler(void)
// {
//     if (RTC_GetITStatus(RTC_IT_ALR) != RESET)
//     {
//         // 处理闹钟事件
//         RTC_ClearITPendingBit(RTC_IT_ALR); // 清除闹钟中断标志
//         RTC_WaitForLastTask();
//     }
// }
